app/Http/Controllers/Auth/logininController.php

        } elseif ($verify) {
            session()->forget('verificationId');

            $user->update([
                'status' => User::$active,
            ]);
---
update `users` set `status` = 'active' where `id` = 1041