app/Http/Controllers/Auth/VerificationinController.php

    public function index()
    {
        $verificationId = session()->get('verificationId', null);

        if (!empty($verificationId)) {
            $verification = Verification::where('id', $verificationId)
                ->whereNull('verified_at')
                ->where('expired_at', '>', time())
                ->first();
---
select * from `verifications` where `id` = 76 and `verified_at` is null and `expired_at` > 1651315752 limit 1

    public function confirmCode(Request $request)
    {
        $value = $request->get('username');
        $code = $request->get('code');
        $username = $this->username($value);
        $request[$username] = $value;
        $time = time();

        Verification::where($username, $value)
            ->whereNull('verified_at')
            ->where('code', $code)
            ->where('created_at', '>', $time - 24 * 60 * 60)
            ->update([
                'verified_at' => $time,
                'expired_at' => $time + 50,
            ]);
---
update `verifications` set `verified_at` = 1651315817, `expired_at` = 1651315867 where `email` = 'jaylee@aimsity.com' and `verified_at` is null and `code` = '78436' and `created_at` > 1651229417