app/Mixins/RegistrationPackage/UserPackage.php

    private function getLastPurchasedPackage()
    {
        $user = $this->user;

        $lastSalePackage = Sale::where('buyer_id', $user->id)
            ->where('type', Sale::$registrationPackage)
            ->whereNotNull('registration_package_id')
            ->whereNull('refund_at')
            ->latest('created_at')
            ->first();
---
select * from `sales` where `buyer_id` = 1038 and `type` = 'registration_package' and `registration_package_id` is not null and `refund_at` is null order by `created_at` desc limit 1

    public function checkPackageLimit($type, $count = null)
    {
        $user = $this->user;
        $package = $this->getPackage();
        $result = false; // no limit
        $usedCount = 0;

        if (!empty($package) and !is_null($package->{$type})) {
            switch ($type) {
                case 'instructors_count':
                    $usedCount = $user->getOrganizationTeachers()->count();
                    break;

                case 'students_count':
                    $usedCount = $user->getOrganizationStudents()->count();
                    break;

                case 'courses_capacity':
                    $usedCount = $count;
                    break;

                case 'courses_count':
                    $usedCount = Webinar::where('creator_id', $user->id)->count();
---
select count(*) as aggregate from `webinars` where `creator_id` = 1038