app/Http/Controllers/Web/BecomeInstructorController.php

    public function index()
    {
        $user = auth()->user();

        if ($user->isUser()) {
            $categories = Category::where('parent_id', null)
                ->with('subCategories')
                ->get();

            $occupations = $user->occupations->pluck('category_id')->toArray();

            $lastRequest = BecomeInstructor::where('user_id', $user->id)
                ->where('status', 'pending')
                ->first();
---
select * from `categories` where `parent_id` is null
select * from `become_instructors` where `user_id` = 1041 and `status` = 'pending' limit 1