app/Models/Webinar.php

    public function activeSpecialOffer()
    {
        $activeSpecialOffer = SpecialOffer::where('webinar_id', $this->id)
            ->where('status', SpecialOffer::$active)
            ->where('from_date', '<', time())
            ->where('to_date', '>', time())
            ->first();
---
select * from `special_offers` where `webinar_id` = 2019 and `status` = 'active' and `from_date` < 1651313230 and `to_date` > 1651313230 limit 1